tutorials/fluid/hotRoomComfort/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patches
{
    inlet
    {
        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // Construct from zone
        constructFrom zone;

        // Generate zone
        zone
        {
            type        box;
            box         (-0.001 0.25 1.1)(0.001 0.75 1.3);
        }
    }

    outlet
    {
        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // Construct from zone
        constructFrom zone;

        // Generate zone
        zone
        {
            type        box;
            box         (1.75 2.999 0.3)(2.25 3.001 0.5);
        }
    }
}

// ************************************************************************* //
